{
  "format": "graph-model",
  "generatedBy": "TFLite Converter v2.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "signature": {
    "inputs": {
      "input_1": {
        "name": "input_1",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {"size": "1"},
            {"size": "640"},
            {"size": "640"}, 
            {"size": "3"}
          ]
        }
      }
    },
    "outputs": {
      "output_1": {
        "name": "output_1",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {"size": "1"},
            {"size": "4499"},
            {"size": "8400"}
          ]
        }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "input_1",
        "op": "Placeholder",
        "attr": {
          "dtype": {"type": "DT_FLOAT"},
          "shape": {
            "shape": {
              "dim": [
                {"size": "1"},
                {"size": "640"},
                {"size": "640"},
                {"size": "3"}
              ]
            }
          }
        }
      },
      {
        "name": "output_1",
        "op": "Identity",
        "input": ["input_1"],
        "attr": {
          "T": {"type": "DT_FLOAT"}
        }
      }
    ],
    "versions": {
      "producer": 1.14
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "tflite_weights",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ]
} 